docs/math.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-23 Fri 23:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>free42 Random Math Stuff</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Some simple math stuff for free42"
 />











</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/hp42/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">free42 Random Math Stuff</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-04-23 23:52:07</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6a49bbe">1. Metadata</a></li>
<li><a href="#introduction">2. Introduction</a></li>
<li><a href="#orgaaf9597">3. <code>CPLXF</code>: Complex Number Functions</a>
<ul>
<li><a href="#menu-cplxf">3.1. Menu</a></li>
<li><a href="#org1860e22">3.2. Menu Code</a></li>
<li><a href="#orgfb43df8">3.3. Functions</a></li>
</ul>
</li>
<li><a href="#org65f2f24">4. <code>PERCFN</code>: Percentages</a>
<ul>
<li><a href="#menu-percfn">4.1. Menu</a></li>
<li><a href="#orgb380f68">4.2. Menu Code</a></li>
<li><a href="#orgd729768">4.3. Functions</a></li>
</ul>
</li>
<li><a href="#org27a9411">5. <code>INTFUN</code>: Integer related functions</a>
<ul>
<li><a href="#menu-intfun">5.1. Menu</a></li>
<li><a href="#orgc660215">5.2. Menu Code</a></li>
<li><a href="#org93ae989">5.3. Functions</a></li>
</ul>
</li>
<li><a href="#orgd1c3049">6. <code>BINO</code>: Binomials, Factorals, Beta, etc&#x2026;</a>
<ul>
<li><a href="#menu-bino">6.1. Menu</a>
<ul>
<li><a href="#org6e958c6">6.1.1. Menu Code</a></li>
</ul>
</li>
<li><a href="#org2674120">6.2. Functions</a></li>
</ul>
</li>
<li><a href="#orgfe1cd3d">7. <code>ERRFUN</code>: Error &amp; Standard Normal Functions</a>
<ul>
<li><a href="#menu-errfun">7.1. Menu</a></li>
<li><a href="#org1a94477">7.2. Menu Code</a></li>
<li><a href="#org719af7f">7.3. Functions</a></li>
</ul>
</li>
<li><a href="#org98895db">8. <code>HYPTRG</code>: Hyperbolic Trigonometric Functions</a>
<ul>
<li><a href="#menu-hyptrg">8.1. Menu</a></li>
<li><a href="#orgb1481c8">8.2. Menu Code</a></li>
<li><a href="#org45aabe8">8.3. Functions</a></li>
</ul>
</li>
<li><a href="#org7408c1f">9. <code>TRIG</code>: Trigonometric Functions</a>
<ul>
<li><a href="#menu-trig">9.1. Menu</a></li>
<li><a href="#org3902800">9.2. Menu Code</a></li>
<li><a href="#org031db22">9.3. Functions</a></li>
</ul>
</li>
<li><a href="#org3b799a9">10. <code>LPRT</code>: Logs, Powers &amp; Roots</a>
<ul>
<li><a href="#menu-lprt">10.1. Menu</a></li>
<li><a href="#org94bb4fd">10.2. Menu Code</a></li>
<li><a href="#org9a95e9f">10.3. Functions</a></li>
</ul>
</li>
<li><a href="#org3b80dac">11. <code>NLA</code>: Linear Algebra</a>
<ul>
<li><a href="#menu-nla">11.1. Menu</a></li>
<li><a href="#org23b3e08">11.2. Code for Menu</a></li>
<li><a href="#org9d41c96">11.3. Functions</a></li>
</ul>
</li>
<li><a href="#org03044c0">12. <code>POLY</code>: A collection of polynomial tools</a>
<ul>
<li><a href="#menu-poly">12.1. Menu</a></li>
<li><a href="#org141c28f">12.2. Code for Menu</a></li>
<li><a href="#orged0cdaf">12.3. Local functions</a></li>
</ul>
</li>
<li><a href="#orgc28d300">13. <code>VEC3</code>: 3D Real Vector Application</a>
<ul>
<li><a href="#menu-vec3">13.1. Menu</a></li>
<li><a href="#orgf078014">13.2. Code for Menu</a></li>
<li><a href="#org07d83d7">13.3. Local functions</a></li>
</ul>
</li>
<li><a href="#orgc1d0eda">14. EOF</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6a49bbe" class="outline-2">
<h2 id="org6a49bbe"><span class="section-number-2">1</span> Metadata</h2>
<div class="outline-text-2" id="text-1">
<p>
The home for this HTML file is: <a href="https://richmit.github.io/hp42/math.html">https://richmit.github.io/hp42/math.html</a>
</p>

<p>
Files related to this document may be found on github: <a href="https://github.com/richmit/hp42">https://github.com/richmit/hp42</a>
</p>

<p>
Directory contents:
</p>
<table border="0" cellspacing="0" cellpadding="6" rules="none" frame="none" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>src</code></td>
<td class="org-left">-</td>
<td class="org-left">The org-mode file that generated this HTML document</td>
</tr>

<tr>
<td class="org-left"><code>src_42s</code></td>
<td class="org-left">-</td>
<td class="org-left">Ready to convert source listings for 42s code in this document</td>
</tr>

<tr>
<td class="org-left"><code>docs</code></td>
<td class="org-left">-</td>
<td class="org-left">This html document</td>
</tr>

<tr>
<td class="org-left"><code>bin</code></td>
<td class="org-left">-</td>
<td class="org-left">Importable RAW program files</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
This org-mode file collects together a handful of mathematical stuff I find useful.  I keep this stuff in my <a href="https://richmit.github.io/hp42/math.html">custom menu</a>.
</p>
</div>
</div>

<div id="outline-container-orgaaf9597" class="outline-2">
<h2 id="orgaaf9597"><span class="section-number-2">3</span> <code>CPLXF</code>: Complex Number Functions</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-menu-cplxf" class="outline-3">
<h3 id="menu-cplxf"><span class="section-number-3">3.1</span> Menu</h3>
<div class="outline-text-3" id="text-menu-cplxf">
<table id="org2c61808" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RPART</td>
<td class="org-left">Real Part of anumber or matrix</td>
</tr>

<tr>
<td class="org-left">IPART</td>
<td class="org-left">Imaginary Part of a number or matrix</td>
</tr>

<tr>
<td class="org-left">CONJ</td>
<td class="org-left">Complex conjugate of a number or matrix</td>
</tr>

<tr>
<td class="org-left">CABS</td>
<td class="org-left">Magnitude of a number or matrix (built in <code>ABS</code> fails on a complex matrix)</td>
</tr>

<tr>
<td class="org-left">CARG</td>
<td class="org-left">Complex argument of a number or matrix</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1860e22" class="outline-3">
<h3 id="org1860e22"><span class="section-number-3">3.2</span> Menu Code</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"CPLXF"</span> 0 tbl 0 nil 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-CPLXF" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CPLXF)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Auto-generated menu program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"CPLXF"</span>
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu CPLXF</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"RPART"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"RPART"</span>
<span style="color: #fa8072;">"IPART"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"IPART"</span>
<span style="color: #fa8072;">"CONJ"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"CONJ"</span>
<span style="color: #fa8072;">"CABS"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"CABS"</span>
<span style="color: #fa8072;">"CARG"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"CARG"</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 00 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Free labels start at: 2</span>
</pre>
</div>
</div>
</div>
