src/math.org
** Functions

#+BEGIN_SRC hp42s :tangle ../src_42s/math/math.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:RPART)
@@@@ DSC: Real part
@@@@ IN:  X: Number or numeric matrix (element-wise)
@@@@ OUT: X: rpart(x)
@@@@ LBL: 10-14
@@@@ TST: free42_3.0
@@@@ UPD: 2021-04-22
LBL "RPART"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ENTER
XEQ 80 @@@@ ATYP
10
+
GTO IND ST X
LBL 10
RTNERR 4             @@## REQ:free42>=2.5.24
LBL 11               @@@@ Real Number
LBL 12               @@@@ Real Matrix
R↓
RTN
LBL 13               @@@@ Complex Number
LBL 14               @@@@ Complex Matrix
R↓
XEQ 90 @@@@ C→R&I
X<>Y
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:IPART)
@@@@ DSC: Imaginary Part
@@@@ IN:  X: Number or numeric matrix (element-wise)
@@@@ OUT: X: ipart(x)
@@@@ LBL: 20-24
@@@@ TST: free42_3.0
@@@@ UPD: 2021-04-22
LBL "IPART"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ENTER
XEQ 80 @@@@ ATYP
20
+
GTO IND ST X
LBL 20
RTNERR 4             @@## REQ:free42>=2.5.24
LBL 21               @@@@ Real Number
0
RTN
LBL 22               @@@@ Real Matrix
R↓
DIM?
NEWMAT
RTN
LBL 23               @@@@ Complex Number
LBL 24               @@@@ Complex Matrix
R↓
XEQ 90 @@@@ C→R&I
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:CONJ)
@@@@ DSC: Complex Conjugate
@@@@ IN:  X: Number or numeric matrix (element-wise)
@@@@ OUT: X: conj(x)
@@@@ TST: free42_3.0
@@@@ LBL: 30-34
@@@@ BUG: Fails on alpha string matrix
@@@@ UPD: 2021-04-22
LBL "CONJ"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ENTER
XEQ 80 @@@@ ATYP
30
+
GTO IND ST X
LBL 30
RTNERR 4             @@## REQ:free42>=2.5.24
LBL 31               @@@@ Real Number
LBL 32               @@@@ Real Matrix
R↓
RTN
LBL 33               @@@@ Complex Number
LBL 34               @@@@ Complex Matrix
R↓
COMPLEX
+/-
COMPLEX
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:CABS)
@@@@ DSC: Magnitude/absolute value
@@@@ IN:  X: Number or numeric matrix (element-wise) -- built in ABS won't work with a complex matrix
@@@@ OUT: X: |x|
@@@@ TST: CPXRES free42_3.0
@@@@ LBL: 40-44
@@@@ BUG: Returns 0 for real 0 input
@@@@ UPD: 2021-04-22
LBL "CABS"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ENTER
XEQ 80 @@@@ ATYP
40
+
GTO IND ST X
LBL 40
RTNERR 4             @@## REQ:free42>=2.5.24
LBL 41               @@@@ Real Number
LBL 42               @@@@ Real Matrix
R↓
ABS
RTN
LBL 43               @@@@ Complex Number
LBL 44               @@@@ Complex Matrix
R↓
XEQ 92 @@@@ C→M&A
X<>Y
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:CARG)
@@@@ DSC: Complex Argument
@@@@ IN:  X: Number or numeric matrix (element-wise)
@@@@ OUT: X: arg(x)
@@@@ TST: CPXRES free42_3.0
@@@@ LBL: 50-54
@@@@ BUG: Returns 0 for real 0 input
@@@@ UPD: 2021-04-22
LBL "CARG"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ENTER
XEQ 80 @@@@ ATYP
50
+
GTO IND ST X
LBL 50
RTNERR 4             @@## REQ:free42>=2.5.24
LBL 51               @@@@ Real Number
0
RTN
LBL 52               @@@@ Real Matrix
R↓
DIM?
NEWMAT
RTN
LBL 53               @@@@ Complex Number
LBL 54               @@@@ Complex Matrix
R↓
XEQ 92 @@@@ C→M&A
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: Complex Number -> Real Part & Imaginary Part
@@@@ NAM: C→R&I 90
@@@@ IN:  X: Complex Number or Complex Matrix
@@@@ OUT: Y: Real Part of X
@@@@      X: Imaginary Part of X
@@@@ LBL: 91
@@@@ TST: free42_3.0
@@@@ UPD: 2021-04-22
LBL 90
FUNC 12              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ENTER
FS? 73
GTO 91
@@@@ RECT MODE
COMPLEX
RTN
LBL 91
@@@@ POLAR MODE
RECT
COMPLEX
POLAR
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: Complex Number -> Magnitude & Argument (angle)
@@@@ NAM: C→M&A 92
@@@@ IN:  X: Complex Number or Complex Matrix
@@@@ OUT: Y: Magnitude of X
@@@@      X: Complex Argument (angle) of X
@@@@ LBL: 93
@@@@ TST: free42_3.0
@@@@ UPD: 2021-04-22
LBL 92
FUNC 12              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ENTER
FS? 73
GTO 93
@@@@ RECT MODE
POLAR
COMPLEX
RECT
RTN
LBL 93
@@@@ POLAR MODE
COMPLEX
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:ATYP)
@@@@ DSC: Arithmetic Type
@@@@ NAM: ATYP 80
@@@@ IN:  X: an object
@@@@ OUT: X: 1 if input X was a real number
@@@@         2 if input X was a real matrix
@@@@         3 if input X was a complex number
@@@@         4 if input X was a complex matrix
@@@@         0 if none of the above are true
@@@@ TST: free42_3.0
@@@@ FAQ: Even on free42<2.5.24 or a real 42s, X, Y, & Z are preserved. T & Last X not so much.
@@@@ BUG: A 2 will be returned for a real matrix containing strings
@@@@ BUG: In infinite stack mode with an empty stack 2 will be returned as X=0 when we do L4STK
@@@@ LBL: 81-88
@@@@ UPD: 2021-02-23
LBL 80
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
MAT?
GTO 81
GTO 82
LBL 81               @@@@ Matrix
CLA
ARCL ST X
67
POSA
X>0?
GTO 87
GTO 88
LBL 87               @@@@ Complex Matrix
4
RTN
LBL 88               @@@@ Real/String Matrix
2
RTN
LBL 82               @@@@ Not matrix
REAL?
GTO 83
GTO 84
LBL 83               @@@@ Real number
1
RTN
LBL 84               @@@@ Not matrix or real
CPX?
GTO 85
GTO 86
LBL 85               @@@@ Complex number
3
RTN
LBL 86               @@@@ Not matrix, real, or complex
0
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
END
#+END_SRC

