docs/math.html

<div id="outline-container-orgfb43df8" class="outline-3">
<h3 id="orgfb43df8"><span class="section-number-3">3.3</span> Functions</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-RPART" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (RPART)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Real part</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: rpart(x)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 10-14</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"RPART"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> 80 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ATYP</span>
10
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GTO IND ST</span> X
<span style="color: #00ffff;">LBL</span> 10
<span style="color: #00ffff;">RTNERR</span> 4             <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">LBL</span> 11               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real Number</span>
<span style="color: #00ffff;">LBL</span> 12               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real Matrix</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 13               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex Number</span>
<span style="color: #00ffff;">LBL</span> 14               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex Matrix</span>
R&#8595;
<span style="color: #00ffff;">XEQ</span> 90 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">C&#8594;R&amp;I</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-IPART" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (IPART)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Imaginary Part</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: ipart(x)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 20-24</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"IPART"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> 80 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ATYP</span>
20
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GTO IND ST</span> X
<span style="color: #00ffff;">LBL</span> 20
<span style="color: #00ffff;">RTNERR</span> 4             <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">LBL</span> 21               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real Number</span>
0
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 22               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real Matrix</span>
R&#8595;
<span style="color: #00ffff;">DIM</span>?
<span style="color: #00ffff;">NEWMAT</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 23               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex Number</span>
<span style="color: #00ffff;">LBL</span> 24               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex Matrix</span>
R&#8595;
<span style="color: #00ffff;">XEQ</span> 90 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">C&#8594;R&amp;I</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-CONJ" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CONJ)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Complex Conjugate</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: conj(x)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 30-34</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: Fails on alpha string matrix</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"CONJ"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> 80 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ATYP</span>
30
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GTO IND ST</span> X
<span style="color: #00ffff;">LBL</span> 30
<span style="color: #00ffff;">RTNERR</span> 4             <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">LBL</span> 31               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real Number</span>
<span style="color: #00ffff;">LBL</span> 32               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real Matrix</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 33               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex Number</span>
<span style="color: #00ffff;">LBL</span> 34               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex Matrix</span>
R&#8595;
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">+/-</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-CABS" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CABS)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Magnitude/absolute value</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number or numeric matrix (element-wise) -- built in ABS won't work with a complex matrix</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: |x|</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: CPXRES free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 40-44</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: Returns 0 for real 0 input</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"CABS"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> 80 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ATYP</span>
40
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GTO IND ST</span> X
<span style="color: #00ffff;">LBL</span> 40
<span style="color: #00ffff;">RTNERR</span> 4             <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">LBL</span> 41               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real Number</span>
<span style="color: #00ffff;">LBL</span> 42               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real Matrix</span>
R&#8595;
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 43               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex Number</span>
<span style="color: #00ffff;">LBL</span> 44               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex Matrix</span>
R&#8595;
<span style="color: #00ffff;">XEQ</span> 92 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">C&#8594;M&amp;A</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-CARG" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CARG)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Complex Argument</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: arg(x)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: CPXRES free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 50-54</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: Returns 0 for real 0 input</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"CARG"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> 80 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ATYP</span>
50
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GTO IND ST</span> X
<span style="color: #00ffff;">LBL</span> 50
<span style="color: #00ffff;">RTNERR</span> 4             <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">LBL</span> 51               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real Number</span>
0
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 52               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real Matrix</span>
R&#8595;
<span style="color: #00ffff;">DIM</span>?
<span style="color: #00ffff;">NEWMAT</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 53               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex Number</span>
<span style="color: #00ffff;">LBL</span> 54               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex Matrix</span>
R&#8595;
<span style="color: #00ffff;">XEQ</span> 92 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">C&#8594;M&amp;A</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Complex Number -&gt; Real Part &amp; Imaginary Part</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: C&#8594;R&amp;I 90</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Complex Number or Complex Matrix</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: Y: Real Part of X</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">X: Imaginary Part of X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 91</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> 90
<span style="color: #00ffff;">FUNC</span> 12              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">FS</span>? 73
<span style="color: #00ffff;">GTO</span> 91
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">RECT MODE</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 91
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">POLAR MODE</span>
<span style="color: #00ffff;">RECT</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">POLAR</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Complex Number -&gt; Magnitude &amp; Argument (angle)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: C&#8594;M&amp;A 92</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Complex Number or Complex Matrix</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: Y: Magnitude of X</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">X: Complex Argument (angle) of X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 93</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> 92
<span style="color: #00ffff;">FUNC</span> 12              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">FS</span>? 73
<span style="color: #00ffff;">GTO</span> 93
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">RECT MODE</span>
<span style="color: #00ffff;">POLAR</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">RECT</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 93
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">POLAR MODE</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-ATYP" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ATYP)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Arithmetic Type</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: ATYP 80</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: an object</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: 1 if input X was a real number</span>
<span style="color: #ffa500;">@@@@         </span><span style="color: #ff7f24;">2 if input X was a real matrix</span>
<span style="color: #ffa500;">@@@@         </span><span style="color: #ff7f24;">3 if input X was a complex number</span>
<span style="color: #ffa500;">@@@@         </span><span style="color: #ff7f24;">4 if input X was a complex matrix</span>
<span style="color: #ffa500;">@@@@         </span><span style="color: #ff7f24;">0 if none of the above are true</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: Even on free42&lt;2.5.24 or a real 42s, X, Y, &amp; Z are preserved. T &amp; Last X not so much.</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: A 2 will be returned for a real matrix containing strings</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: In infinite stack mode with an empty stack 2 will be returned as X=0 when we do L4STK</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 81-88</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-23</span>
<span style="color: #00ffff;">LBL</span> 80
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">MAT</span>?
<span style="color: #00ffff;">GTO</span> 81
<span style="color: #00ffff;">GTO</span> 82
<span style="color: #00ffff;">LBL</span> 81               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Matrix</span>
<span style="color: #00ffff;">CLA</span>
<span style="color: #00ffff;">ARCL</span> ST X
67
<span style="color: #00ffff;">POSA</span>
<span style="color: #00ffff;">X&gt;0</span>?
<span style="color: #00ffff;">GTO</span> 87
<span style="color: #00ffff;">GTO</span> 88
<span style="color: #00ffff;">LBL</span> 87               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex Matrix</span>
4
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 88               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real/String Matrix</span>
2
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 82               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Not matrix</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">GTO</span> 83
<span style="color: #00ffff;">GTO</span> 84
<span style="color: #00ffff;">LBL</span> 83               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Real number</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 84               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Not matrix or real</span>
<span style="color: #00ffff;">CPX</span>?
<span style="color: #00ffff;">GTO</span> 85
<span style="color: #00ffff;">GTO</span> 86
<span style="color: #00ffff;">LBL</span> 85               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Complex number</span>
3
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 86               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Not matrix, real, or complex</span>
0
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>
