src/math.org
* =PERCFN=: Percentages
** Menu
:PROPERTIES:
:CUSTOM_ID: menu-percfn
:END:

#+ATTR_HTML: :align center :frame box :rules all
#+NAME:PERCFN
| Menu | Description                      |                  |                 |
|------+----------------------------------+------------------+-----------------|
| %T   | Percentage of total              | Y: TOTAL X: PART | X: % of Total   |
| %CH  | percentage of change from Y to X | Y: OLD X: New    | X: % Change     |
| %    | Percentage                       | Y: Y X: X        | Y: Y X: X% of Y |

** Menu Code

#+BEGIN_SRC elisp :var tbl=PERCFN :colnames y :results output verbatum :wrap "src hp42s :tangle ../src_42s/math/math.hp42s"
(MJR-generate-42-menu-code "PERCFN" 0 tbl 0 nil 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
#+END_SRC

#+RESULTS:
#+begin_src hp42s :tangle ../src_42s/math/math.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:PERCFN)
@@@@ DSC: Auto-generated menu program
LBL "PERCFN"
LBL 01            @@@@ Page 1 of menu PERCFN
CLMENU
"%T"
KEY 1 XEQ "%T"
"%CH"
KEY 2 XEQ 02
"%"
KEY 3 XEQ 03
KEY 9 GTO 00
MENU
STOP
GTO 01
LBL 00 @@@@ Application Exit
EXITALL
RTN
LBL 02    @@@@ Action for menu key %CH
%CH
RTN
LBL 03    @@@@ Action for menu key %
%
RTN
@@@@ Free labels start at: 4
#+end_src

** Functions

#+BEGIN_SRC hp42s :tangle ../src_42s/math/math.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:PTOT)
@@@@ DSC: Percentage of total (just like hp-12c button)
@@@@ IN:  Y: Real Number -- Total
@@@@ IN:  X: Real Number -- Part
@@@@ OUT: X: 100*X/Y
@@@@ UPD: 2021-03-12
LBL "%T"
FUNC 21              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
X<>Y
÷
100
×
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
END
#+END_SRC

* =INTFUN=: Integer related functions
** Menu
:PROPERTIES:
:CUSTOM_ID: menu-intfun
:END:

#+ATTR_HTML: :align center :frame box :rules all
#+NAME:INTFUN
| Menu | LBL   | Description                                 |
|------+-------+---------------------------------------------|
| FLOR | FLOOR | Truncate toward negative infinity           |
| CEIL |       | Truncate toward positive infinity           |
| ROND | ROUND | Truncate toward nearest integer (even rule) |
| TRUN | IP    | Truncate toward zero                        |
|      |       |                                             |
| FP   |       |                                             |
|------+-------+---------------------------------------------|
| GCD  |       | Greatest Common Denominator                 |
| LCM  |       | Least Common Multiple                       |
|      |       |                                             |
|      |       |                                             |
| DIV  | BASE÷ |                                             |
| REM  | MOD   |                                             |
|------+-------+---------------------------------------------|

