docs/math.html

<div id="outline-container-org65f2f24" class="outline-2">
<h2 id="org65f2f24"><span class="section-number-2">4</span> <code>PERCFN</code>: Percentages</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-menu-percfn" class="outline-3">
<h3 id="menu-percfn"><span class="section-number-3">4.1</span> Menu</h3>
<div class="outline-text-3" id="text-menu-percfn">
<table id="org0392412" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">%T</td>
<td class="org-left">Percentage of total</td>
<td class="org-left">Y: TOTAL X: PART</td>
<td class="org-left">X: % of Total</td>
</tr>

<tr>
<td class="org-left">%CH</td>
<td class="org-left">percentage of change from Y to X</td>
<td class="org-left">Y: OLD X: New</td>
<td class="org-left">X: % Change</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">Percentage</td>
<td class="org-left">Y: Y X: X</td>
<td class="org-left">Y: Y X: X% of Y</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb380f68" class="outline-3">
<h3 id="orgb380f68"><span class="section-number-3">4.2</span> Menu Code</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"PERCFN"</span> 0 tbl 0 nil 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-PERCFN" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (PERCFN)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Auto-generated menu program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"PERCFN"</span>
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu PERCFN</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"%T"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"%T"</span>
<span style="color: #fa8072;">"%CH"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 02
<span style="color: #fa8072;">"%"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 03
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 00 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 02    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key %CH</span>
<span style="color: #00ffff;">%CH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 03    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key %</span>
<span style="color: #00ffff;">%</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Free labels start at: 4</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd729768" class="outline-3">
<h3 id="orgd729768"><span class="section-number-3">4.3</span> Functions</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-PTOT" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (PTOT)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Percentage of total (just like hp-12c button)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  Y: Real Number -- Total</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Real Number -- Part</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: 100*X/Y</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-03-12</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"%T"</span>
<span style="color: #00ffff;">FUNC</span> 21              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
100
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org27a9411" class="outline-2">
<h2 id="org27a9411"><span class="section-number-2">5</span> <code>INTFUN</code>: Integer related functions</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-menu-intfun" class="outline-3">
<h3 id="menu-intfun"><span class="section-number-3">5.1</span> Menu</h3>
<div class="outline-text-3" id="text-menu-intfun">
<table id="orgf78608c" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">LBL</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">FLOR</td>
<td class="org-left">FLOOR</td>
<td class="org-left">Truncate toward negative infinity</td>
</tr>

<tr>
<td class="org-left">CEIL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Truncate toward positive infinity</td>
</tr>

<tr>
<td class="org-left">ROND</td>
<td class="org-left">ROUND</td>
<td class="org-left">Truncate toward nearest integer (even rule)</td>
</tr>

<tr>
<td class="org-left">TRUN</td>
<td class="org-left">IP</td>
<td class="org-left">Truncate toward zero</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FP</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">GCD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Greatest Common Denominator</td>
</tr>

<tr>
<td class="org-left">LCM</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Least Common Multiple</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DIV</td>
<td class="org-left">BASE÷</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">REM</td>
<td class="org-left">MOD</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
