docs/math.html

<div id="outline-container-orgc660215" class="outline-3">
<h3 id="orgc660215"><span class="section-number-3">5.2</span> Menu Code</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"INTFUN"</span> 0 tbl 0 1 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-INTFUN" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (INTFUN)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Auto-generated menu program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"INTFUN"</span>
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu INTFUN</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"FLOR"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"FLOOR"</span>
<span style="color: #fa8072;">"CEIL"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"CEIL"</span>
<span style="color: #fa8072;">"ROND"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"ROUND"</span>
<span style="color: #fa8072;">"TRUN"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 03
<span style="color: #fa8072;">"FP"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 04
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 02            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu INTFUN</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"GCD"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"GCD"</span>
<span style="color: #fa8072;">"LCM"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"LCM"</span>
<span style="color: #fa8072;">"DIV"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 05
<span style="color: #fa8072;">"REM"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 06
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">LBL</span> 00 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 03    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key TRUN</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 04    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key FP</span>
<span style="color: #00ffff;">FP</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 05    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key DIV</span>
<span style="color: #00ffff;">BASE&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 06    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key REM</span>
<span style="color: #00ffff;">MOD</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Free labels start at: 7</span>
</pre>
</div>
</div>
</div>
