src/math.org
** Functions

#+begin_src hp42s :tangle ../src_42s/math/math.hp42s

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:ROUND)
@@@@ DSC: Properly round to integer.  N.5 rounded to nearest even number.
@@@@ IN:  X: real number
@@@@ OUT: X: floor(X)
@@@@ UPD: 2021-02-23
@@@@ TST: free42_3.0
@@@@ TC:  -2.0 -2 →Int
@@@@ TC:  -1.6 -2 →Nearest
@@@@ TC:  -1.5 -2 →Even
@@@@ TC:  -1.4 -1 →Nearest
@@@@ TC:  -1.0 -1 →Int
@@@@ TC:  -1.6 -1 →Nearest
@@@@ TC:  -0.5  0 Even Rule
@@@@ TC:  -0.4  0 →Nearest
@@@@ TC:   0.0  0 →Int
@@@@ TC:   0.4  0 →Nearest
@@@@ TC:   0.5  0 Even Rule
@@@@ TC:   1.6  1 →Nearest
@@@@ TC:   1.0  1 →Int
@@@@ TC:   1.4  1 →Nearest
@@@@ TC:   1.5  2 →Even
@@@@ TC:   1.6  2 →Nearest
@@@@ TC:   2.0  2 →Int
LBL "ROUND"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ENTER     @@@@ X        X
FP        @@@@ FP       X
ABS       @@@@ |FP|     X
0.5       @@@@ 1/2      |FP|     X
-         @@@@ |FP|-1/2 X
X<>Y      @@@@ X        |FP|-1/2 X
SIGN      @@@@ SGN      |FP|-1/2 X 
LASTX     @@@@ X        SGN      |FP|-1/2 X 
IP        @@@@ IP(X)    SGN      |FP|-1/2 X 
0=? ST Z
GTO 92
0<? ST Z
+
RTN
LBL 92 
@@@@ FP=1/2
XEQ 93 @@@@ ODD?
+
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: RETYES if X is odd, RTNNO otherwise
LBL 93 @@@@ ODD?
FUNC 00
L4STK
2
÷
FP
X=0?
RTNNO
RTNYES

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:FLOOR)
@@@@ DSC: Floor -- Round toward negative infinity
@@@@ IN:  X: real number
@@@@ OUT: X: floor(X)
@@@@ UPD: 2021-02-23
@@@@ TST: free42_3.0
LBL "FLOOR"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
FP
LASTX
IP
0≤? ST Y
RTN
1
-
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:CEIL)
@@@@ DSC: Ceiling -- Round toward positive infinity
@@@@ IN:  X: real number
@@@@ OUT: X: ceil(X)
@@@@ UPD: 2021-02-23
@@@@ TST: free42_3.0
LBL "CEIL"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
FP
LASTX
IP
0≥? ST Y
RTN
1
+
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:GCD)
@@@@ DSC: GCD
@@@@ IN:  Y: real number
@@@@      X: real number
@@@@ OUT: X: GCD(|IP(X)|, |IP(X)|)
@@@@ LBL: 91
@@@@ UPD: 2021-04-22
@@@@ TST: free42_3.0
LBL "GCD"
FUNC 21              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ABS
IP
X<>Y
ABS
IP
X>Y?
X<>Y
LBL 91
STO ST Z
MOD
X>0?
GTO 91
R↓
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:LCM)
@@@@ DSC: LCM
@@@@ IN:  Y: real number
@@@@      X: real number
@@@@ OUT: X: LCM(|IP(X)|, |IP(X)|)
@@@@ USE: GCD
@@@@ UPD: 2021-04-22
@@@@ TST: free42_3.0
LBL "LCM"
FUNC 21              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ABS                  @@@@ |X|             Y
IP                   @@@@ IP(|X|)         Y
X=0?                                      
RTN                                       
X<>Y                 @@@@ Y               IP(|X|) 
ABS                  @@@@ |Y|             IP(|X|) 
IP                   @@@@ IP(|Y|)         IP(|X|) 
X=0?                                      
RTN                                       
RCL ST Y             @@@@ IP(|X|)         IP(|Y|)         IP(|X|) 
RCL ST Y             @@@@ IP(|Y|)         IP(|X|)         IP(|Y|)         IP(|X|) 
×                    @@@@ IP(|Y|)*IP(|X|) IP(|Y|)         IP(|X|) 
RCL ST Z             @@@@ IP(|X|)         IP(|Y|)*IP(|X|) IP(|Y|)         IP(|X|) 
RCL ST Z             @@@@ IP(|Y|)         IP(|X|)         IP(|Y|)*IP(|X|) IP(|Y|)
XEQ "GCD"            @@@@ GCD             IP(|Y|)*IP(|X|) IP(|Y|)         IP(|Y|)
÷                    @@@@ LCM             IP(|Y|)         IP(|Y|)         IP(|Y|)
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
END
#+END_SRC

