docs/math.html

<div id="outline-container-org93ae989" class="outline-3">
<h3 id="org93ae989"><span class="section-number-3">5.3</span> Functions</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-hp42s">
<span id="coderef-ROUND" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ROUND)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Properly round to integer.  N.5 rounded to nearest even number.</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: real number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: floor(X)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-23</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -2.0 -2 &#8594;Int</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -1.6 -2 &#8594;Nearest</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -1.5 -2 &#8594;Even</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -1.4 -1 &#8594;Nearest</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -1.0 -1 &#8594;Int</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -1.6 -1 &#8594;Nearest</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -0.5  0 Even Rule</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -0.4  0 &#8594;Nearest</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   0.0  0 &#8594;Int</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   0.4  0 &#8594;Nearest</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   0.5  0 Even Rule</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   1.6  1 &#8594;Nearest</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   1.0  1 &#8594;Int</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   1.4  1 &#8594;Nearest</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   1.5  2 &#8594;Even</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   1.6  2 &#8594;Nearest</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   2.0  2 &#8594;Int</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"ROUND"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>     <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X        X</span>
<span style="color: #00ffff;">FP</span>        <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FP       X</span>
<span style="color: #00ffff;">ABS</span>       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">|FP|     X</span>
0.5       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">1/2      |FP|     X</span>
<span style="color: #00ffff;">-</span>         <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">|FP|-1/2 X</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X        |FP|-1/2 X</span>
<span style="color: #00ffff;">SIGN</span>      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">SGN      |FP|-1/2 X </span>
<span style="color: #00ffff;">LASTX</span>     <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X        SGN      |FP|-1/2 X </span>
<span style="color: #00ffff;">IP</span>        <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IP(X)    SGN      |FP|-1/2 X </span>
0=? ST Z
<span style="color: #00ffff;">GTO</span> 92
0&lt;? ST Z
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 92 
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FP=1/2</span>
<span style="color: #00ffff;">XEQ</span> 93 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ODD?</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: RETYES if X is odd, RTNNO otherwise</span>
<span style="color: #00ffff;">LBL</span> 93 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ODD?</span>
<span style="color: #00ffff;">FUNC</span> 00
<span style="color: #00ffff;">L4STK</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">FP</span>
<span style="color: #00ffff;">X=0</span>?
<span style="color: #00ffff;">RTNNO</span>
<span style="color: #00ffff;">RTNYES</span>

<span id="coderef-FLOOR" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (FLOOR)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Floor -- Round toward negative infinity</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: real number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: floor(X)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-23</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"FLOOR"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">FP</span>
<span style="color: #00ffff;">LASTX</span>
<span style="color: #00ffff;">IP</span>
0&#8804;? ST Y
<span style="color: #00ffff;">RTN</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-CEIL" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CEIL)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Ceiling -- Round toward positive infinity</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: real number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: ceil(X)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-23</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"CEIL"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">FP</span>
<span style="color: #00ffff;">LASTX</span>
<span style="color: #00ffff;">IP</span>
0&#8805;? ST Y
<span style="color: #00ffff;">RTN</span>
1
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-GCD" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (GCD)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: GCD</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  Y: real number</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">X: real number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: GCD(|IP(X)|, |IP(X)|)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 91</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-22</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"GCD"</span>
<span style="color: #00ffff;">FUNC</span> 21              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">X&gt;Y</span>?
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">LBL</span> 91
<span style="color: #00ffff;">STO ST</span> Z
<span style="color: #00ffff;">MOD</span>
<span style="color: #00ffff;">X&gt;0</span>?
<span style="color: #00ffff;">GTO</span> 91
R&#8595;
<span style="color: #00ffff;">RTN</span>

<span id="coderef-LCM" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (LCM)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: LCM</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  Y: real number</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">X: real number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: LCM(|IP(X)|, |IP(X)|)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">USE: GCD</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-22</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"LCM"</span>
<span style="color: #00ffff;">FUNC</span> 21              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ABS</span>                  <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">|X|             Y</span>
<span style="color: #00ffff;">IP</span>                   <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IP(|X|)         Y</span>
<span style="color: #00ffff;">X=0</span>?                                      
<span style="color: #00ffff;">RTN</span>                                       
<span style="color: #00ffff;">X&lt;&gt;Y</span>                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Y               IP(|X|) </span>
<span style="color: #00ffff;">ABS</span>                  <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">|Y|             IP(|X|) </span>
<span style="color: #00ffff;">IP</span>                   <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IP(|Y|)         IP(|X|) </span>
<span style="color: #00ffff;">X=0</span>?                                      
<span style="color: #00ffff;">RTN</span>                                       
<span style="color: #00ffff;">RCL ST</span> Y             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IP(|X|)         IP(|Y|)         IP(|X|) </span>
<span style="color: #00ffff;">RCL ST</span> Y             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IP(|Y|)         IP(|X|)         IP(|Y|)         IP(|X|) </span>
<span style="color: #00ffff;">&#215;</span>                    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IP(|Y|)*IP(|X|) IP(|Y|)         IP(|X|) </span>
<span style="color: #00ffff;">RCL ST</span> Z             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IP(|X|)         IP(|Y|)*IP(|X|) IP(|Y|)         IP(|X|) </span>
<span style="color: #00ffff;">RCL ST</span> Z             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IP(|Y|)         IP(|X|)         IP(|Y|)*IP(|X|) IP(|Y|)</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"GCD"</span>            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GCD             IP(|Y|)*IP(|X|) IP(|Y|)         IP(|Y|)</span>
<span style="color: #00ffff;">&#247;</span>                    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LCM             IP(|Y|)         IP(|Y|)         IP(|Y|)</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>
