src/math.org
* =BINO=: Binomials, Factorals, Beta, etc...
** Menu
:PROPERTIES:
:CUSTOM_ID: menu-bino
:END:

#+ATTR_HTML: :align center :frame box :rules all
#+NAME:BINO
| Menu | LBL   | Description |
|------+-------+-------------|
| COMB |       |             |
| PERM |       |             |
| !    | FACT  | Factoral    |
| ▒▒▒▒ |       |             |
| GAM  | GAMMA |             |
| BETA |       |             |
|------+-------+-------------|

*** Menu Code

#+BEGIN_SRC elisp :var tbl=BINO :colnames y :results output verbatum :wrap "src hp42s :tangle ../src_42s/math/math.hp42s"
(MJR-generate-42-menu-code "BINO" 0 tbl 0 1 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
#+END_SRC

#+RESULTS:
#+begin_src hp42s :tangle ../src_42s/math/math.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:BINO)
@@@@ DSC: Auto-generated menu program
LBL "BINO"
LBL 01            @@@@ Page 1 of menu BINO
CLMENU
"COMB"
KEY 1 XEQ 02
"PERM"
KEY 2 XEQ 03
"!"
KEY 3 XEQ "FACT"
"GAM"
KEY 5 XEQ 04
"BETA"
KEY 6 XEQ "BETA"
KEY 9 GTO 00
MENU
STOP
GTO 01
LBL 00 @@@@ Application Exit
EXITALL
RTN
LBL 02    @@@@ Action for menu key COMB
COMB
RTN
LBL 03    @@@@ Action for menu key PERM
PERM
RTN
LBL 04    @@@@ Action for menu key GAM
GAMMA
RTN
@@@@ Free labels start at: 5
#+end_src

** Functions

#+BEGIN_SRC hp42s :tangle ../src_42s/math/math.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:BETA)
@@@@ DSC: beta function
@@@@ IN:  Y: Number
@@@@ IN:  X: Number
@@@@ OUT: X: beta(x, y) = beta(y, x)
@@@@ TST: free42_3.0
@@@@ UPD: 2021-02-23
LBL "BETA"
FUNC 21              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
RCL ST Y
GAMMA
RCL ST Y
GAMMA
×
RCL ST Z
RCL ST Z
+
GAMMA
÷
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:FACT)
@@@@ DSC: Factoral function
@@@@ IN:  X: Number
@@@@ OUT: X: X! = Gamma(X+1)
@@@@ FAQ: Returns an error if X is not an integer
@@@@ TST: free42_3.0
@@@@ UPD: 2021-04-23
LBL "FACT"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ENTER
FP
X≠0?
RTNERR 5
R↓
1
+
GAMMA
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
END
#+END_SRC

* =ERRFUN=: Error & Standard Normal Functions
** Menu
:PROPERTIES:
:CUSTOM_ID: menu-errfun
:END:

#+ATTR_HTML: :align center :frame box :rules all
#+NAME:ERRFUN
| Menu | Description                                      |
|------+--------------------------------------------------|
| ERF  | Error Function                                   |
| ERFC | Complementary Error Function                     |
| ▒▒▒▒ |                                                  |
| NPDF | Standard Normal Probablity Density FUnction      |
| NCDF | Standard Normal Cumulative Distribution FUnction |
| ▒▒▒▒ |                                                  |

** Menu Code

#+BEGIN_SRC elisp :var tbl=ERRFUN :colnames y :results output verbatum :wrap "src hp42s :tangle ../src_42s/math/math.hp42s"
(MJR-generate-42-menu-code "ERRFUN" 0 tbl 0 nil 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
#+END_SRC

#+RESULTS:
#+begin_src hp42s :tangle ../src_42s/math/math.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:ERRFUN)
@@@@ DSC: Auto-generated menu program
LBL "ERRFUN"
LBL 01            @@@@ Page 1 of menu ERRFUN
CLMENU
"ERF"
KEY 1 XEQ "ERF"
"ERFC"
KEY 2 XEQ "ERFC"
"NPDF"
KEY 4 XEQ "NPDF"
"NCDF"
KEY 5 XEQ "NCDF"
KEY 9 GTO 00
MENU
STOP
GTO 01
LBL 00 @@@@ Application Exit
EXITALL
RTN
@@@@ Free labels start at: 2
#+end_src

