docs/math.html

<div id="outline-container-orgd1c3049" class="outline-2">
<h2 id="orgd1c3049"><span class="section-number-2">6</span> <code>BINO</code>: Binomials, Factorals, Beta, etc&#x2026;</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-menu-bino" class="outline-3">
<h3 id="menu-bino"><span class="section-number-3">6.1</span> Menu</h3>
<div class="outline-text-3" id="text-menu-bino">
<table id="org36caf06" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">LBL</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">COMB</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PERM</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">!</td>
<td class="org-left">FACT</td>
<td class="org-left">Factoral</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GAM</td>
<td class="org-left">GAMMA</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">BETA</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org6e958c6" class="outline-4">
<h4 id="org6e958c6"><span class="section-number-4">6.1.1</span> Menu Code</h4>
<div class="outline-text-4" id="text-6-1-1">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"BINO"</span> 0 tbl 0 1 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-BINO" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (BINO)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Auto-generated menu program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"BINO"</span>
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu BINO</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"COMB"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 02
<span style="color: #fa8072;">"PERM"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 03
<span style="color: #fa8072;">"!"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"FACT"</span>
<span style="color: #fa8072;">"GAM"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 04
<span style="color: #fa8072;">"BETA"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"BETA"</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 00 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 02    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key COMB</span>
<span style="color: #00ffff;">COMB</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 03    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key PERM</span>
<span style="color: #00ffff;">PERM</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 04    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key GAM</span>
<span style="color: #00ffff;">GAMMA</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Free labels start at: 5</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2674120" class="outline-3">
<h3 id="org2674120"><span class="section-number-3">6.2</span> Functions</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-BETA" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (BETA)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: beta function</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  Y: Number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: beta(x, y) = beta(y, x)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-23</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"BETA"</span>
<span style="color: #00ffff;">FUNC</span> 21              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">GAMMA</span>
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">GAMMA</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GAMMA</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-FACT" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (FACT)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Factoral function</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: X! = Gamma(X+1)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: Returns an error if X is not an integer</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-23</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"FACT"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">FP</span>
<span style="color: #00ffff;">X&#8800;0</span>?
<span style="color: #00ffff;">RTNERR</span> 5
R&#8595;
1
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GAMMA</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfe1cd3d" class="outline-2">
<h2 id="orgfe1cd3d"><span class="section-number-2">7</span> <code>ERRFUN</code>: Error &amp; Standard Normal Functions</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-menu-errfun" class="outline-3">
<h3 id="menu-errfun"><span class="section-number-3">7.1</span> Menu</h3>
<div class="outline-text-3" id="text-menu-errfun">
<table id="orgb589499" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ERF</td>
<td class="org-left">Error Function</td>
</tr>

<tr>
<td class="org-left">ERFC</td>
<td class="org-left">Complementary Error Function</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">NPDF</td>
<td class="org-left">Standard Normal Probablity Density FUnction</td>
</tr>

<tr>
<td class="org-left">NCDF</td>
<td class="org-left">Standard Normal Cumulative Distribution FUnction</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1a94477" class="outline-3">
<h3 id="org1a94477"><span class="section-number-3">7.2</span> Menu Code</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"ERRFUN"</span> 0 tbl 0 nil 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-ERRFUN" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ERRFUN)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Auto-generated menu program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"ERRFUN"</span>
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu ERRFUN</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"ERF"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"ERF"</span>
<span style="color: #fa8072;">"ERFC"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"ERFC"</span>
<span style="color: #fa8072;">"NPDF"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"NPDF"</span>
<span style="color: #fa8072;">"NCDF"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"NCDF"</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 00 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Free labels start at: 2</span>
</pre>
</div>
</div>
</div>
