docs/math.html

<div id="outline-container-org719af7f" class="outline-3">
<h3 id="org719af7f"><span class="section-number-3">7.3</span> Functions</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-NPDF" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (NPDF)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Standard Normal PDF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: real number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: Standard Normal PDF value at X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-22</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -2 0.05399096651318805195056</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -1 0.2419707245191433497978</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   0 0.3989422804014326779399</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   1 0.2419707245191433497978</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   2 0.05399096651318805195056</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"NPDF"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">X&#8593;2</span>   <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X^2</span>
-2    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">-2                     X^2</span>
<span style="color: #00ffff;">&#247;</span>     <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">-X^2/2</span>
<span style="color: #00ffff;">E&#8593;X</span>   <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">EXP(-X^2/2)</span>
2     <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">2                      EXP(-X^2/2)</span>
<span style="color: #00ffff;">PI</span>    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PI                     2             EXP(-X^2/2)</span>
<span style="color: #00ffff;">&#215;</span>     <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PI*2                   EXP(-X^2/2)</span>
<span style="color: #00ffff;">SQRT</span>  <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">SQRT(PI*2)             EXP(-X^2/2)</span>
<span style="color: #00ffff;">&#247;</span>     <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">EXP(-X^2/2)/SQRT(PI*2) </span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-NCDF" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (NCDF)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Standard Normal CDF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: real number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: Standard Normal CDF value at X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: Only good to 7 decimal places</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: No dependancies, variables, loops, or branches</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">REF: Zelen &amp; Severo (1964)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-22</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -2 0.02275013194817920720028</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  -1 0.1586552539314570514148 </span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   0 0.5                      </span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   1 0.8413447460685429485852 </span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:   2 0.9772498680518207927997 </span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"NCDF"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
0.2316419      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">b0                     X             ?           ?</span>
<span style="color: #00ffff;">RCL&#215; ST</span> Y      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">b0*X                   X             ?           ?</span>
1              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">1                      b0*X          X           ?           </span>
<span style="color: #00ffff;">+</span>              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">1+b0*X                 X             ?           ?</span>
<span style="color: #00ffff;">1/X</span>            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">1/(1+b0*X)             X             ?           ?</span>
               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">T                      X             ?           ?</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>           <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X                      T             ?           ?</span>
<span style="color: #00ffff;">X&#8593;2</span>            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X^2                    T             ?           ?</span>
-2             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">-2                     X^2           ?           ?</span>
<span style="color: #00ffff;">&#247;</span>              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">-X^2/2                 T             ?           ?</span>
<span style="color: #00ffff;">E&#8593;X</span>            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">EXP(-X^2/2)            T             ?           ?</span>
2              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">2                      EXP(-X^2/2)   T           ?</span>
<span style="color: #00ffff;">PI</span>             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PI                     2             EXP(-X^2/2) T</span>
<span style="color: #00ffff;">&#215;</span>              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PI*2                   EXP(-X^2/2)   T           T</span>
<span style="color: #00ffff;">SQRT</span>           <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">SQRT(PI*2)             EXP(-X^2/2)   T           T</span>
<span style="color: #00ffff;">&#247;</span>              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">EXP(-X^2/2)/SQRT(PI*2) T             T           T</span>
               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">N                      T             T           T</span>
<span style="color: #00ffff;">RCL</span>  ST Y      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">T                      N             T           T</span>
<span style="color: #00ffff;">&#215;</span>              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NT                     T             T           T</span>
0.319381530    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">b1                     NT            T           T</span>
<span style="color: #00ffff;">RCL&#215; ST</span> Y      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PR                     NT            T           T</span>
<span style="color: #00ffff;">RCL ST</span> Z       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">T                      PR            NT          T</span>
<span style="color: #00ffff;">STO&#215; ST</span> Z      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">T                      PR            NT^2        T</span>
R&#8595;             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PR                     NT^2          T           T</span>
-0.356563782   <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">b2                     PR            NT^2        T</span>
<span style="color: #00ffff;">RCL&#215; ST</span> Z      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NT                     PR            NT^2        T</span>
<span style="color: #00ffff;">+</span>              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PR                     NT^2          T           T</span>
<span style="color: #00ffff;">RCL ST</span> Z       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">T                      PR            NT^2        T</span>
<span style="color: #00ffff;">STO&#215; ST</span> Z      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">T                      PR            NT^3        T</span>
R&#8595;             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PR                     NT^3          T           T</span>
1.781477937    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">b3                     PR            NT^3        T</span>
<span style="color: #00ffff;">RCL&#215; ST</span> Z      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NT                     PR            NT^3        T</span>
<span style="color: #00ffff;">+</span>              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PR                     NT^3          T           T</span>
<span style="color: #00ffff;">RCL ST</span> Z       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">T                      PR            NT^3        T</span>
<span style="color: #00ffff;">STO&#215; ST</span> Z      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">T                      PR            NT^4        T</span>
R&#8595;             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PR                     NT^4          T           T</span>
-1.821255978   <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">b4                     PR            NT^4        T</span>
<span style="color: #00ffff;">RCL&#215; ST</span> Z      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NT                     PR            NT^4        T</span>
<span style="color: #00ffff;">+</span>              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PR                     NT^4          T           T</span>
<span style="color: #00ffff;">RCL ST</span> Z       <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">T                      PR            NT^4        T</span>
<span style="color: #00ffff;">STO&#215; ST</span> Z      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">T                      PR            NT^5        T</span>
R&#8595;             <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PR                     NT^5          T           T</span>
1.330274429    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">b5                     PR            NT^5        T</span>
<span style="color: #00ffff;">RCL&#215; ST</span> Z      <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NT                     PR            NT^5        T</span>
<span style="color: #00ffff;">+</span>              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PR                     NT^5          T           T</span>
1              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">1                      PR            NT^5        T</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>           <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">PR                     1             NT^5        T</span>
<span style="color: #00ffff;">-</span>              <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">1-PR                   NT^5          T           T</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-ERF" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ERF)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: erf (error) function</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: real number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: erf(X)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">USE: NCDF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: Use: 11-12</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-03-30</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC: -1 -0.8427007929497148693412</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  0  0.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  1  0.8427007929497148693412</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  2  0.9953222650189527341621</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"ERF"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">ENTER</span>
2
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"NCDF"</span>
2
<span style="color: #00ffff;">&#215;</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">X&lt;0</span>?
<span style="color: #00ffff;">GTO</span> 11
<span style="color: #00ffff;">GTO</span> 12
<span style="color: #00ffff;">LBL</span> 11
R&#8595;
<span style="color: #00ffff;">+/-</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 12
R&#8595;
<span style="color: #00ffff;">RTN</span>

<span id="coderef-ERFC" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ERFC)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: erfc (complementary error) function</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: real number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: erfc(X)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">USE: ERF</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-03-30</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC: -1 1.842700792949714869341</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  0 1.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  1 0.1572992070502851306588</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  2 0.004677734981047265837931</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"ERFC"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"ERF"</span>
1
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>
