src/math.org
* =HYPTRG=: Hyperbolic Trigonometric Functions
** Menu
:PROPERTIES:
:CUSTOM_ID: menu-hyptrg
:END:

#+ATTR_HTML: :align center :frame box :rules all
#+NAME:HYPTRG
| Menu  | Description |
|-------+-------------|
| SINH  |             |
| COSH  |             |
| TANH  |             |
| ASINH |             |
| ACOSH |             |
| ATANH |             |
|-------+-------------|
| CSCH  | 1/SINH(X)   |
| SECH  | 1/COSH(X)   |
| COTH  | 1/TANH(X)   |
| ACSCH | SINH(1/X)   |
| ASECH | COSH(1/X)   |
| ACOTH | TANH(1/X)   |
|-------+-------------|

** Menu Code

#+BEGIN_SRC elisp :var tbl=HYPTRG :colnames y :results output verbatum :wrap "src hp42s :tangle ../src_42s/math/math.hp42s"
(MJR-generate-42-menu-code "HYPTRG" 0 tbl 0 nil 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
#+END_SRC

#+RESULTS:
#+begin_src hp42s :tangle ../src_42s/math/math.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:HYPTRG)
@@@@ DSC: Auto-generated menu program
LBL "HYPTRG"
LBL 01            @@@@ Page 1 of menu HYPTRG
CLMENU
"SINH"
KEY 1 XEQ 03
"COSH"
KEY 2 XEQ 04
"TANH"
KEY 3 XEQ 05
"ASINH"
KEY 4 XEQ 06
"ACOSH"
KEY 5 XEQ 07
"ATANH"
KEY 6 XEQ 08
KEY 7 GTO 02
KEY 8 GTO 02
KEY 9 GTO 00
MENU
STOP
GTO 01
LBL 02            @@@@ Page 2 of menu HYPTRG
CLMENU
"CSCH"
KEY 1 XEQ "CSCH"
"SECH"
KEY 2 XEQ "SECH"
"COTH"
KEY 3 XEQ "COTH"
"ACSCH"
KEY 4 XEQ "ACSCH"
"ASECH"
KEY 5 XEQ "ASECH"
"ACOTH"
KEY 6 XEQ "ACOTH"
KEY 7 GTO 01
KEY 8 GTO 01
KEY 9 GTO 00
MENU
STOP
GTO 02
LBL 00 @@@@ Application Exit
EXITALL
RTN
LBL 03    @@@@ Action for menu key SINH
SINH
RTN
LBL 04    @@@@ Action for menu key COSH
COSH
RTN
LBL 05    @@@@ Action for menu key TANH
TANH
RTN
LBL 06    @@@@ Action for menu key ASINH
ASINH
RTN
LBL 07    @@@@ Action for menu key ACOSH
ACOSH
RTN
LBL 08    @@@@ Action for menu key ATANH
ATANH
RTN
@@@@ Free labels start at: 9
#+end_src

** Functions

#+BEGIN_SRC hp42s :tangle ../src_42s/math/math.hp42s

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: 1/SIN(X)
LBL "CSCH"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
SINH
1/X
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: 1/COS(X)
LBL "SECH"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
COSH
1/X
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: 1/TAN(X)
LBL "COTH"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
TANH
1/X
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: SIN(1/X)
LBL "ACSCH"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
1/X
ASINH
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: COS(1/X)
LBL "ASECH"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
1/X
ACOSH
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: TAN(1/X)
LBL "ACOTH"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
1/X
ATANH
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
END
#+END_SRC

