docs/math.html



<div id="outline-container-org98895db" class="outline-2">
<h2 id="org98895db"><span class="section-number-2">8</span> <code>HYPTRG</code>: Hyperbolic Trigonometric Functions</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-menu-hyptrg" class="outline-3">
<h3 id="menu-hyptrg"><span class="section-number-3">8.1</span> Menu</h3>
<div class="outline-text-3" id="text-menu-hyptrg">
<table id="orgb3463e6" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SINH</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">COSH</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TANH</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ASINH</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ACOSH</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ATANH</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">CSCH</td>
<td class="org-left">1/SINH(X)</td>
</tr>

<tr>
<td class="org-left">SECH</td>
<td class="org-left">1/COSH(X)</td>
</tr>

<tr>
<td class="org-left">COTH</td>
<td class="org-left">1/TANH(X)</td>
</tr>

<tr>
<td class="org-left">ACSCH</td>
<td class="org-left">SINH(1/X)</td>
</tr>

<tr>
<td class="org-left">ASECH</td>
<td class="org-left">COSH(1/X)</td>
</tr>

<tr>
<td class="org-left">ACOTH</td>
<td class="org-left">TANH(1/X)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb1481c8" class="outline-3">
<h3 id="orgb1481c8"><span class="section-number-3">8.2</span> Menu Code</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"HYPTRG"</span> 0 tbl 0 nil 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-HYPTRG" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (HYPTRG)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Auto-generated menu program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"HYPTRG"</span>
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu HYPTRG</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"SINH"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 03
<span style="color: #fa8072;">"COSH"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 04
<span style="color: #fa8072;">"TANH"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 05
<span style="color: #fa8072;">"ASINH"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 06
<span style="color: #fa8072;">"ACOSH"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 07
<span style="color: #fa8072;">"ATANH"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 08
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 02            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu HYPTRG</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"CSCH"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"CSCH"</span>
<span style="color: #fa8072;">"SECH"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"SECH"</span>
<span style="color: #fa8072;">"COTH"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"COTH"</span>
<span style="color: #fa8072;">"ACSCH"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"ACSCH"</span>
<span style="color: #fa8072;">"ASECH"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"ASECH"</span>
<span style="color: #fa8072;">"ACOTH"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"ACOTH"</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">LBL</span> 00 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 03    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key SINH</span>
<span style="color: #00ffff;">SINH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 04    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key COSH</span>
<span style="color: #00ffff;">COSH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 05    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key TANH</span>
<span style="color: #00ffff;">TANH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 06    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key ASINH</span>
<span style="color: #00ffff;">ASINH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 07    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key ACOSH</span>
<span style="color: #00ffff;">ACOSH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 08    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key ATANH</span>
<span style="color: #00ffff;">ATANH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Free labels start at: 9</span>
</pre>
</div>
</div>
</div>
