docs/math.html

<div id="outline-container-org031db22" class="outline-3">
<h3 id="org031db22"><span class="section-number-3">9.3</span> Functions</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-hp42s">
<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Inverse Haversine</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: ahav(X)=2*asin(sqrt(X))</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-18</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"AHAV"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">ASIN</span>
2
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Haversine</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: hav(X)=1/2-cos(X)/2</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-18</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"HAV"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">COS</span>
-2
<span style="color: #00ffff;">&#247;</span>
0.5
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Hypot</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  Y: number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: sqrt(abs(x)^2+abs(y)^2)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-23</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"HYPOT"</span>
<span style="color: #00ffff;">FUNC</span> 21              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: 1/SIN(X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"CSC"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">SIN</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: 1/COS(X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"SEC"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">COS</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: 1/TAN(X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"COT"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">TAN</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: SIN(1/X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"ACSC"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">ASIN</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: COS(1/X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"ASEC"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">ACOS</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: TAN(1/X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"ACOT"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">ATAN</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: ATAN2</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  Y: number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: atan2(y, x)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: Only works in RAD mode</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-23</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  atan( 1, 1) =&gt;  pi/4     =   45&#176;</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  atan(-1, 1) =&gt; -pi/4     =  -45&#176;</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  atan( 1,-1) =&gt;  3*pi/4   =  135&#176;</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  atan(-1,-1) =&gt; -3*pi/4   = -135&#176;</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  atan( 0, 1) =&gt;  0        =    0&#176;</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  atan( 1, 0) =&gt;  pi       =   90&#176;</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  atan(-1, 0) =&gt; -pi       =  -90&#176;</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TC:  atan( 0, 0) =&gt; ERROR</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: Used 81-85</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"TAN2"</span>
<span style="color: #00ffff;">FUNC</span> 21              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">X&gt;0</span>?
<span style="color: #00ffff;">GTO</span> 81
<span style="color: #00ffff;">X=0</span>?
<span style="color: #00ffff;">GTO</span> 82
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X&lt;0</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">X&lt;0</span>?
<span style="color: #00ffff;">GTO</span> 83
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X&lt;0 &amp; Y&gt;=0</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">ATAN</span>
<span style="color: #00ffff;">PI</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 83
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X&lt;0 &amp; Y&lt;0</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">ATAN</span>
<span style="color: #00ffff;">PI</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 82
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">X=0</span>?
<span style="color: #00ffff;">GTO</span> 84
<span style="color: #00ffff;">X&gt;0</span>?
<span style="color: #00ffff;">GTO</span> 85
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X=0 &amp; Y&lt;0</span>
<span style="color: #00ffff;">PI</span>
-2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 85
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X=0 &amp; Y&gt;0</span>
<span style="color: #00ffff;">PI</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 84
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X=0 &amp; Y=0 ERROR 0/0</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 81
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X&gt;0</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">ATAN</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>
