src/math.org
* =LPRT=: Logs, Powers & Roots
** Menu
:PROPERTIES:
:CUSTOM_ID: menu-lprt
:END:

#+ATTR_HTML: :align center :frame box :rules all
#+NAME:LPRT
| Menu | Lab    | Description                                          |
|------+--------+------------------------------------------------------|
| lnYX | lnYX   | Base Y Logarithm of X                                |
| ▒▒▒▒ |        |                                                      |
| ln2  | ln2    | Base 2 logarithm                                     |
| LN   |        | Base 3 logarithm                                     |
| LOG  |        | Base 10 logarithm                                    |
| ▒▒▒▒ |        |                                                      |
|------+--------+------------------------------------------------------|
| Y↑X  |        | Raise Y to the power of X                            |
| ▒▒▒▒ |        |                                                      |
| 2↑X  | LBL 97 | Raise 2 to the power of X                            |
| EXP  |        | Raise e to the power of X                            |
| 10↑X |        | Raise 10 to the power of X                           |
| ▒▒▒▒ |        |                                                      |
|------+--------+------------------------------------------------------|
| Y√X  | YROOT  | Yth roots prefering real & pure imaginary answers    |
| ▒▒▒▒ |        |                                                      |
| 2√X  | LBL 95 | Square root prefering real & pure imaginary answers  |
| 3√X  | LBL 94 | Cube root prefering real & pure imaginary answers    |
| 5√X  | LBL 93 | Fifth root prefering real & pure imaginary answers   |
| 7√X  | LBL 92 | Seventh root prefering real & pure imaginary answers |

** Menu Code
#+BEGIN_SRC elisp :var tbl=LPRT :colnames y :results output verbatum :wrap "src hp42s :tangle ../src_42s/math/math.hp42s"
(MJR-generate-42-menu-code "LPRT" 0 tbl 0 1 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
#+END_SRC

#+RESULTS:
#+begin_src hp42s :tangle ../src_42s/math/math.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:LPRT)
@@@@ DSC: Auto-generated menu program
LBL "LPRT"
LBL 01            @@@@ Page 1 of menu LPRT
CLMENU
"lnYX"
KEY 1 XEQ "lnYX"
"ln2"
KEY 3 XEQ "ln2"
"LN"
KEY 4 XEQ 04
"LOG"
KEY 5 XEQ 05
KEY 7 GTO 03
KEY 8 GTO 02
KEY 9 GTO 00
MENU
STOP
GTO 01
LBL 02            @@@@ Page 2 of menu LPRT
CLMENU
"Y↑X"
KEY 1 XEQ 06
"2↑X"
KEY 3 XEQ 97
"EXP"
KEY 4 XEQ "EXP"
"10↑X"
KEY 5 XEQ 07
KEY 7 GTO 01
KEY 8 GTO 03
KEY 9 GTO 00
MENU
STOP
GTO 02
LBL 03            @@@@ Page 3 of menu LPRT
CLMENU
"Y√X"
KEY 1 XEQ "YROOT"
"2√X"
KEY 3 XEQ 95
"3√X"
KEY 4 XEQ 94
"5√X"
KEY 5 XEQ 93
"7√X"
KEY 6 XEQ 92
KEY 7 GTO 02
KEY 8 GTO 01
KEY 9 GTO 00
MENU
STOP
GTO 03
LBL 00 @@@@ Application Exit
EXITALL
RTN
LBL 04    @@@@ Action for menu key LN
LN
RTN
LBL 05    @@@@ Action for menu key LOG
LOG
RTN
LBL 06    @@@@ Action for menu key Y↑X
Y↑X
RTN
LBL 07    @@@@ Action for menu key 10↑X
10↑X
RTN
@@@@ Free labels start at: 8
#+end_src

