docs/math.html

<div id="outline-container-org3b799a9" class="outline-2">
<h2 id="org3b799a9"><span class="section-number-2">10</span> <code>LPRT</code>: Logs, Powers &amp; Roots</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-menu-lprt" class="outline-3">
<h3 id="menu-lprt"><span class="section-number-3">10.1</span> Menu</h3>
<div class="outline-text-3" id="text-menu-lprt">
<table id="orgbc180c8" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Lab</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">lnYX</td>
<td class="org-left">lnYX</td>
<td class="org-left">Base Y Logarithm of X</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ln2</td>
<td class="org-left">ln2</td>
<td class="org-left">Base 2 logarithm</td>
</tr>

<tr>
<td class="org-left">LN</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Base 3 logarithm</td>
</tr>

<tr>
<td class="org-left">LOG</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Base 10 logarithm</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Y↑X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Raise Y to the power of X</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2↑X</td>
<td class="org-left">LBL 97</td>
<td class="org-left">Raise 2 to the power of X</td>
</tr>

<tr>
<td class="org-left">EXP</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Raise e to the power of X</td>
</tr>

<tr>
<td class="org-left">10↑X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Raise 10 to the power of X</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Y√X</td>
<td class="org-left">YROOT</td>
<td class="org-left">Yth roots prefering real &amp; pure imaginary answers</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2√X</td>
<td class="org-left">LBL 95</td>
<td class="org-left">Square root prefering real &amp; pure imaginary answers</td>
</tr>

<tr>
<td class="org-left">3√X</td>
<td class="org-left">LBL 94</td>
<td class="org-left">Cube root prefering real &amp; pure imaginary answers</td>
</tr>

<tr>
<td class="org-left">5√X</td>
<td class="org-left">LBL 93</td>
<td class="org-left">Fifth root prefering real &amp; pure imaginary answers</td>
</tr>

<tr>
<td class="org-left">7√X</td>
<td class="org-left">LBL 92</td>
<td class="org-left">Seventh root prefering real &amp; pure imaginary answers</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org94bb4fd" class="outline-3">
<h3 id="org94bb4fd"><span class="section-number-3">10.2</span> Menu Code</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"LPRT"</span> 0 tbl 0 1 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-LPRT" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (LPRT)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Auto-generated menu program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"LPRT"</span>
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu LPRT</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"lnYX"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"lnYX"</span>
<span style="color: #fa8072;">"ln2"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"ln2"</span>
<span style="color: #fa8072;">"LN"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 04
<span style="color: #fa8072;">"LOG"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 05
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 02            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu LPRT</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"Y&#8593;X"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 06
<span style="color: #fa8072;">"2&#8593;X"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 97
<span style="color: #fa8072;">"EXP"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"EXP"</span>
<span style="color: #fa8072;">"10&#8593;X"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 07
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">LBL</span> 03            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 3 of menu LPRT</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"Y&#8730;X"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"YROOT"</span>
<span style="color: #fa8072;">"2&#8730;X"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 95
<span style="color: #fa8072;">"3&#8730;X"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 94
<span style="color: #fa8072;">"5&#8730;X"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 93
<span style="color: #fa8072;">"7&#8730;X"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 92
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">LBL</span> 00 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 04    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key LN</span>
<span style="color: #00ffff;">LN</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 05    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key LOG</span>
<span style="color: #00ffff;">LOG</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 06    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key Y&#8593;X</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 07    <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key 10&#8593;X</span>
<span style="color: #00ffff;">10&#8593;X</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Free labels start at: 8</span>
</pre>
</div>
</div>
</div>
