docs/math.html

<div id="outline-container-org9a95e9f" class="outline-3">
<h3 id="org9a95e9f"><span class="section-number-3">10.3</span> Functions</h3>
<div class="outline-text-3" id="text-10-3">
<div class="org-src-container">
<pre class="src src-hp42s"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Base Y Logarithm of X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  Y: logarithm base</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">X: number or matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: log_y(x)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-14</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"lnYX"</span>
<span style="color: #00ffff;">FUNC</span> 21              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LN</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">LN</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Base 2 Logarithm</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: number or matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: log_2(x)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-23</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"ln2"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LN</span>
2
<span style="color: #00ffff;">LN</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Raise 2 to the power of X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: 2&#8593;X 97</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: number or matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: 2^X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-23</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #00ffff;">LBL</span> 97
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
2
<span style="color: #00ffff;">X&lt;&gt;Y</span>
Y^X
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Square root prefering real &amp; pure imaginary answers </span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: ROOT2 95  </span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: root of X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: See XYROOT for details</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-14</span>
<span style="color: #00ffff;">LBL</span> 95
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
2
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"YROOT"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Cube root prefering real &amp; pure imaginary answers   </span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: ROOT3 94  </span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: root of X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: See XYROOT for details</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-14</span>
<span style="color: #00ffff;">LBL</span> 94
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
3
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"YROOT"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Fifth root prefering real &amp; pure imaginary answers  </span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: ROOT5 93  </span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: root of X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: See XYROOT for details</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-14</span>
<span style="color: #00ffff;">LBL</span> 93
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
5
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"YROOT"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Seventh root prefering real &amp; pure imaginary answers</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">NAM: ROOT7 92  </span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: root of X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: See XYROOT for details</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-14</span>
<span style="color: #00ffff;">LBL</span> 92
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
7
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"YROOT"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Nth roots prefering real &amp; pure imaginary answers</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  Y: Number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: Yth root of X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: The principal value is not always returned (by design)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: Real integers are not recognized in complex form. i.e. 0+2i &#8800; 2</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: Return is pure imaginary when Y is an odd integer and X&lt;0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: Return is real when  Y is an even integer and X&lt;0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-23</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"YROOT"</span>
<span style="color: #00ffff;">FUNC</span> 21              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">GTO</span> 81
<span style="color: #00ffff;">GTO</span> 84
<span style="color: #00ffff;">LBL</span> 81
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X is real</span>
<span style="color: #00ffff;">X&#8805;0</span>?
<span style="color: #00ffff;">GTO</span> 84
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X is negative, real</span>
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">GTO</span> 82
<span style="color: #00ffff;">GTO</span> 83
<span style="color: #00ffff;">LBL</span> 82
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X is negative, real; Y is real</span>
<span style="color: #00ffff;">FP</span>
<span style="color: #00ffff;">X&#8800;0</span>?
<span style="color: #00ffff;">GTO</span> 83
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X is negative, real; Y is real integer</span>
R&#8595;
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">XEQ</span> 84
<span style="color: #00ffff;">+/-</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">FP</span>
<span style="color: #00ffff;">X=0</span>?
<span style="color: #00ffff;">GTO</span> 86
<span style="color: #00ffff;">GTO</span> 85
<span style="color: #00ffff;">LBL</span> 86
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X is negative, real; Y is real integer even</span>
R&#8595;
-1
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 85
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">X is negative, real; Y is real integer odd</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 83
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Not special case.  Stack: Y X Y</span>
R&#8595;
<span style="color: #00ffff;">LBL</span> 84
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Not special case.  Stack: X Y</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #00ffff;">END</span>

</pre>
</div>
</div>
</div>
</div>
