src/math.org
* =NLA=: Linear Algebra
** Menu
:PROPERTIES:
:CUSTOM_ID: menu-nla
:END:

#+ATTR_HTML: :align center :frame box :rules all
#+NAME:NLA
| Menu | Lab    |                                            | Inputs | Output             | Status     |
|------+--------+--------------------------------------------+--------+--------------------+------------|
| IDEN | IDEN   | Create an nxn identity matrix              | X: N   | X: identity matrix | *COMPLETE* |
| DIAG | DIAG   | Create diagonal matrix with given elements | X: VEC | X: diagonal matrix | *COMPLETE* |
|      |        |                                            |        |                    |            |
|      |        |                                            |        |                    |            |
|      |        |                                            |        |                    |            |
|      |        |                                            |        |                    |            |
|------+--------+--------------------------------------------+--------+--------------------+------------|
| MAT  | LBL 98 | Store/Recall Current CPOLY matrix          |        |                    |            |
| X    | LBL 97 | Store/Recall current value of "X"          |        |                    |            |
|      |        |                                            |        |                    |            |
|      |        |                                            |        |                    |            |
|      |        |                                            |        |                    |            |
| EVCP | CPOLY  | Evaluate Characteristic polynomial         |        |                    |            |

** Code for Menu

#+BEGIN_SRC elisp :var tbl=NLA :colnames y :results output verbatum :wrap "src hp42s :tangle ../src_42s/math/math.hp42s"
(MJR-generate-42-menu-code "NLA" 0 tbl 0 1 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
#+END_SRC

#+RESULTS:
#+begin_src hp42s :tangle ../src_42s/math/math.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:NLA)
@@@@ DSC: Auto-generated menu program
LBL "NLA"
LBL 01            @@@@ Page 1 of menu NLA
CLMENU
"IDEN"
KEY 1 XEQ "IDEN"
"DIAG"
KEY 2 XEQ "DIAG"
KEY 7 GTO 02
KEY 8 GTO 02
KEY 9 GTO 00
MENU
STOP
GTO 01
LBL 02            @@@@ Page 2 of menu NLA
CLMENU
"MAT"
KEY 1 XEQ 98
"X"
KEY 2 XEQ 97
"EVCP"
KEY 6 XEQ "CPOLY"
KEY 7 GTO 01
KEY 8 GTO 01
KEY 9 GTO 00
MENU
STOP
GTO 02
LBL 00 @@@@ Application Exit
EXITALL
RTN
@@@@ Free labels start at: 3
#+end_src

