docs/math.html

<div id="outline-container-org3b80dac" class="outline-2">
<h2 id="org3b80dac"><span class="section-number-2">11</span> <code>NLA</code>: Linear Algebra</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-menu-nla" class="outline-3">
<h3 id="menu-nla"><span class="section-number-3">11.1</span> Menu</h3>
<div class="outline-text-3" id="text-menu-nla">
<table id="org5c0d183" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Lab</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Inputs</th>
<th scope="col" class="org-left">Output</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">IDEN</td>
<td class="org-left">IDEN</td>
<td class="org-left">Create an nxn identity matrix</td>
<td class="org-left">X: N</td>
<td class="org-left">X: identity matrix</td>
<td class="org-left"><b>COMPLETE</b></td>
</tr>

<tr>
<td class="org-left">DIAG</td>
<td class="org-left">DIAG</td>
<td class="org-left">Create diagonal matrix with given elements</td>
<td class="org-left">X: VEC</td>
<td class="org-left">X: diagonal matrix</td>
<td class="org-left"><b>COMPLETE</b></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">MAT</td>
<td class="org-left">LBL 98</td>
<td class="org-left">Store/Recall Current CPOLY matrix</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">X</td>
<td class="org-left">LBL 97</td>
<td class="org-left">Store/Recall current value of "X"</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">EVCP</td>
<td class="org-left">CPOLY</td>
<td class="org-left">Evaluate Characteristic polynomial</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org23b3e08" class="outline-3">
<h3 id="org23b3e08"><span class="section-number-3">11.2</span> Code for Menu</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"NLA"</span> 0 tbl 0 1 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-NLA" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (NLA)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Auto-generated menu program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"NLA"</span>
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu NLA</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"IDEN"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"IDEN"</span>
<span style="color: #fa8072;">"DIAG"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"DIAG"</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 02            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu NLA</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"MAT"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 98
<span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 97
<span style="color: #fa8072;">"EVCP"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"CPOLY"</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">LBL</span> 00 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Free labels start at: 3</span>
</pre>
</div>
</div>
</div>
