src/math.org
** Functions

#+BEGIN_SRC hp42s :tangle ../src_42s/math/math.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:IDEN)
@@@@ DSC: Create an XxX identity matrix
@@@@ IN:  X: Size of matrix to make
@@@@ OUT: X: Identity matrix of size X
@@@@ LBL: 21-22
@@@@ UPD: 2021-03-12
LBL "IDEN"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
ENTER
NEWMAT
LSTO "TMPM"
INDEX "TMPM"
1
LBL 21
STOEL
J+
FS? 77
GTO 22
I+
GTO 21
LBL 22
RCL "TMPM"
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:DIAG)
@@@@ DSC: Create diagonal matrix with given elements
@@@@ IN:  X: Vector
@@@@ IN:  X: diagonal matrix
@@@@ LBL: 23
@@@@ UPD: 2021-03-12
LBL "DIAG"
FUNC 11              @@## REQ:free42>=2.5.24
L4STK                @@## REQ:free42>=3.0
LSTO "TMPM"
INDEX "TMPM"
DIM?
×
ENTER
DIM "TMPM"
1000
÷
1
+
LSTO "I"
LBL 23
1
RCL "I"
STOIJ
R↓
R↓
RCLEL
0
STOEL
R↓
RCL "I"
RCL "I"
STOIJ
R↓
R↓
STOEL
ISG "I"
GTO 23
RCL "TMPM"
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:CPOLY)
@@@@ DSC: Evaluate Chararstic Polynomial of a Matrix: DET(M-X*I)
@@@@ I/O: N/A MVAR program
@@@@ VAR: CPM a square matrix
@@@@ VAR: X a real or complex number
@@@@ LAB: 24-25
@@@@ FAQ: Can be used 
@@@@ UPD: 2021-04-23
LBL "CPOLY"
MVAR "CPM"
MVAR "X"
RCL "CPM"
LSTO "TMPM"
INDEX "TMPM"
R↓
RCL "X"
LBL 24
RCLEL
RCL- ST Y
STOEL
R↓
J+
FS? 77
GTO 25
I+
GTO 24
LBL 25
RCL "TMPM"
DET
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ Store/Recall variable "CPM"
LBL 98 
FS? 64
RCL "CPM"
STO "CPM"
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ Store/Recall variable "X"
LBL 97
FS? 64
RCL "X"
STO "X"
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
END
#+END_SRC

* =POLY=: A collection of polynomial tools
** Menu
:PROPERTIES:
:CUSTOM_ID: menu-poly
:END:

#+ATTR_HTML: :align center :frame box :rules all
#+NAME:POLY
| Menu  | Program |                                   | Inputs         | Output              | Status     |
|-------+---------+-----------------------------------+----------------+---------------------+------------|
| QUADE | QUADE   | Solve quadratic: Ax^2+Bx+C=0      | Z: A Y: B X: C | Y: root 1 X: root 2 | *complete* |
| EVAL  | PEVAL   | Evaluate polynomial P @ X         | Y: P  X: X     | X: P(x)             | *complete* |
| ▒▒▒▒  |         |                                   |                |                     |            |
| ▒▒▒▒  |         |                                   |                |                     |            |
| ▒▒▒▒  |         |                                   |                |                     |            |
| ▒▒▒▒  |         |                                   |                |                     |            |
|-------+---------+-----------------------------------+----------------+---------------------+------------|
| POLY  | LBL 98  | Store/Recall Current Polynomial   |                |                     |            |
| X     | LBL 97  | Store/Recall current value of "X" |                |                     |            |
| ▒▒▒▒  |         |                                   |                |                     |            |
| ▒▒▒▒  |         |                                   |                |                     |            |
| ▒▒▒▒  |         |                                   |                |                     |            |
| EVAL  | PWRP    | Evaluate wrapped polynomial at X  | N/A            | X: P("X")           | *TODO*     |

