docs/math.html

<div id="outline-container-org9d41c96" class="outline-3">
<h3 id="org9d41c96"><span class="section-number-3">11.3</span> Functions</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-IDEN" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (IDEN)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Create an XxX identity matrix</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Size of matrix to make</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: Identity matrix of size X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 21-22</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-03-12</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"IDEN"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">NEWMAT</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"TMPM"</span>
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"TMPM"</span>
1
<span style="color: #00ffff;">LBL</span> 21
<span style="color: #00ffff;">STOEL</span>
<span style="color: #00ffff;">J+</span>
<span style="color: #00ffff;">FS</span>? 77
<span style="color: #00ffff;">GTO</span> 22
<span style="color: #00ffff;">I+</span>
<span style="color: #00ffff;">GTO</span> 21
<span style="color: #00ffff;">LBL</span> 22
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"TMPM"</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-DIAG" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (DIAG)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Create diagonal matrix with given elements</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: Vector</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: diagonal matrix</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 23</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-03-12</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"DIAG"</span>
<span style="color: #00ffff;">FUNC</span> 11              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"TMPM"</span>
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"TMPM"</span>
<span style="color: #00ffff;">DIM</span>?
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">DIM</span> <span style="color: #fa8072;">"TMPM"</span>
1000
<span style="color: #00ffff;">&#247;</span>
1
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"I"</span>
<span style="color: #00ffff;">LBL</span> 23
1
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"I"</span>
<span style="color: #00ffff;">STOIJ</span>
R&#8595;
R&#8595;
<span style="color: #00ffff;">RCLEL</span>
0
<span style="color: #00ffff;">STOEL</span>
R&#8595;
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"I"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"I"</span>
<span style="color: #00ffff;">STOIJ</span>
R&#8595;
R&#8595;
<span style="color: #00ffff;">STOEL</span>
<span style="color: #00ffff;">ISG</span> <span style="color: #fa8072;">"I"</span>
<span style="color: #00ffff;">GTO</span> 23
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"TMPM"</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-CPOLY" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CPOLY)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Evaluate Chararstic Polynomial of a Matrix: DET(M-X*I)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">I/O: N/A MVAR program</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">VAR: CPM a square matrix</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">VAR: X a real or complex number</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LAB: 24-25</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: Can be used </span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-23</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"CPOLY"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"CPM"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"CPM"</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"TMPM"</span>
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"TMPM"</span>
R&#8595;
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">LBL</span> 24
<span style="color: #00ffff;">RCLEL</span>
<span style="color: #00ffff;">RCL- ST</span> Y
<span style="color: #00ffff;">STOEL</span>
R&#8595;
<span style="color: #00ffff;">J+</span>
<span style="color: #00ffff;">FS</span>? 77
<span style="color: #00ffff;">GTO</span> 25
<span style="color: #00ffff;">I+</span>
<span style="color: #00ffff;">GTO</span> 24
<span style="color: #00ffff;">LBL</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"TMPM"</span>
<span style="color: #00ffff;">DET</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Store/Recall variable "CPM"</span>
<span style="color: #00ffff;">LBL</span> 98 
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"CPM"</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"CPM"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Store/Recall variable "X"</span>
<span style="color: #00ffff;">LBL</span> 97
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org03044c0" class="outline-2">
<h2 id="org03044c0"><span class="section-number-2">12</span> <code>POLY</code>: A collection of polynomial tools</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-menu-poly" class="outline-3">
<h3 id="menu-poly"><span class="section-number-3">12.1</span> Menu</h3>
<div class="outline-text-3" id="text-menu-poly">
<table id="orgd9dc3b6" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Program</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Inputs</th>
<th scope="col" class="org-left">Output</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">QUADE</td>
<td class="org-left">QUADE</td>
<td class="org-left">Solve quadratic: Ax^2+Bx+C=0</td>
<td class="org-left">Z: A Y: B X: C</td>
<td class="org-left">Y: root 1 X: root 2</td>
<td class="org-left"><b>complete</b></td>
</tr>

<tr>
<td class="org-left">EVAL</td>
<td class="org-left">PEVAL</td>
<td class="org-left">Evaluate polynomial P @ X</td>
<td class="org-left">Y: P  X: X</td>
<td class="org-left">X: P(x)</td>
<td class="org-left"><b>complete</b></td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">POLY</td>
<td class="org-left">LBL 98</td>
<td class="org-left">Store/Recall Current Polynomial</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">X</td>
<td class="org-left">LBL 97</td>
<td class="org-left">Store/Recall current value of "X"</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">EVAL</td>
<td class="org-left">PWRP</td>
<td class="org-left">Evaluate wrapped polynomial at X</td>
<td class="org-left">N/A</td>
<td class="org-left">X: P("X")</td>
<td class="org-left"><b>TODO</b></td>
</tr>
</tbody>
</table>
</div>
</div>
