docs/math.html

<div id="outline-container-org141c28f" class="outline-3">
<h3 id="org141c28f"><span class="section-number-3">12.2</span> Code for Menu</h3>
<div class="outline-text-3" id="text-12-2">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"POLY"</span> 0 tbl 0 1 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-POLY" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (POLY)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Auto-generated menu program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"POLY"</span>
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu POLY</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"QUADE"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"QUADE"</span>
<span style="color: #fa8072;">"EVAL"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"PEVAL"</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 02            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu POLY</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"POLY"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 98
<span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 97
<span style="color: #fa8072;">"EVAL"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"PWRP"</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">LBL</span> 00 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Free labels start at: 3</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orged0cdaf" class="outline-3">
<h3 id="orged0cdaf"><span class="section-number-3">12.3</span> Local functions</h3>
<div class="outline-text-3" id="text-12-3">
<div class="org-src-container">
<pre class="src src-hp42s"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Solve quadratic equation: ax^2+bx+c=0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  Z: a</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">Y: b</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">X: c</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: Y: root_1 (-b-sqrt(b^2-4ac))/(2a)</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">X: root_2 (-b+sqrt(b^2-4ac))/(2a)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: No error checking</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-02</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"QUADE"</span>
<span style="color: #00ffff;">FUNC</span> 32              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
-4
<span style="color: #00ffff;">RCL&#215; ST</span> T
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">X&#8593;2</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">SQRT</span>
2
<span style="color: #00ffff;">RCL&#215; ST</span> T
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">LASTX</span>
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">+/-</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RCL ST</span> X
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Evaluate a polynomial</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  Y: Matrix with polynomial coefficients.  DIM of 1xn, nx1, whatever...</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">X: Value at which polynomial should be evaluated</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: Y: original polynomial matrix</span>
<span style="color: #ffa500;">@@@@      </span><span style="color: #ff7f24;">X: value of polynomial evaluated at X</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">LBL: 91</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-03</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"PEVAL"</span>
<span style="color: #00ffff;">FUNC</span> 21              <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>                <span style="color: #ffa500;">@@</span><span style="color: #ff7f24;">## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"TMPM"</span>
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"TMPM"</span>
<span style="color: #00ffff;">WRAP</span>
0
<span style="color: #00ffff;">LBL</span> 91
<span style="color: #00ffff;">RCL&#215; ST</span> Z
<span style="color: #00ffff;">RCLEL</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">J+</span>
<span style="color: #00ffff;">FC</span>? 77
<span style="color: #00ffff;">GTO</span> 91
<span style="color: #00ffff;">RTN</span>

<span id="coderef-PWRP" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (PWRP)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Make a polynomial stored in a matrix into a =MVAR= function</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  X: N/A</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: X: N/A</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GLB: WRPP -- Store a polynomial matrix in this variable</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42_3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">FAQ: Allows one to use SOLVER &amp; INTEG on polynomials</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">USE: PEVAL</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-04-03</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"PWRP"</span>
<span style="color: #00ffff;">MVAR</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"WRPP"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"PEVAL"</span>
<span style="color: #00ffff;">RTN</span>


<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Store/Recall variable "WRPP"</span>
<span style="color: #00ffff;">LBL</span> 98 
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"WRPP"</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"WRPP"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Store/Recall variable "X"</span>
<span style="color: #00ffff;">LBL</span> 97
<span style="color: #00ffff;">FS</span>? 64
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"X"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc28d300" class="outline-2">
<h2 id="orgc28d300"><span class="section-number-2">13</span> <code>VEC3</code>: 3D Real Vector Application</h2>
<div class="outline-text-2" id="text-13">
<p>
This is a simple little application that makes working with 3D vectors less painfull.  
</p>
</div>
